// 1  -----------------------------------------------------------------------
export const arrayC = (n,c) => {
    let array = [];
    for (let i = 0; i < n; i++) {
        console.log(c);
        array.push(c);
    }
    return array; 
};
// 関数本体がreturn文以外にも存在するのでreturnキーワード、セミコロン、中括弧は省略できない

// 2  -----------------------------------------------------------------------
export const squareX = x => x * x;
// アロー関数のパラメータが1つだけの場合は、パラメータを囲む丸括弧も省略できる
// 関数本体が return 文だけの場合は、returnキーワードとセミコロン、中括弧を省略できる

// 3  -----------------------------------------------------------------------
export const now = () => new Date();
// 引数が０個なので丸括弧は省略できない
// 関数本体が return 文だけの場合は、returnキーワードとセミコロン、中括弧を省略できる

// --------------------------------------------------------------------------------------
arrayC(5, "test");
// test
// test
// test
// test
// test